---
kind: other
id: Methods.T:Autodesk.Revit.DB.Architecture.TopographyLinkType
source: html/99b43ad4-4977-40d8-487b-83f3ed091fd6.htm
---
# TopographyLinkType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.